Repository: marcosjunqueira/sonar-l10n-pt-omegat
Catalog: tm/logger-omegat.tmx
Source language: en_us
Languages: pt_br

source: Testing Tools
pt_br: Ferramentas de teste

source: Exception Reporter
pt_br: Relator de exceção

source: Allows automatic reporting of exceptions to our UI Gestures Server
pt_br: Permite relatório automático de exceções para nosso servidor de gestos de UI

source: &Username:
pt_br: Nome de &usuário:

source: If you want to get informed about the state of this problem, you need to be a registered user.
pt_br: Se desejar receber informações sobre a situação deste problema, você precisa ser um usuário registrado.

source: If you are not registered, you can
pt_br: Se você não é registrado, você pode

source: register here,
pt_br: registrar-se aqui,

source: Dialog for reporting issues
pt_br: Caixa de diálogo para relatar problemas

source: Report Dialog
pt_br: Caixa de diálogo para relatório

source: NetBeans user name
pt_br: Nome de usuário do NetBeans

source: NetBeans user name.
pt_br: Nome de usuário NetBeans.

source: You should fill this field if you are a registered user.
pt_br: É necessário preencher este campo se você for um usuário registrado.

source: You should write short summary of the exception
pt_br: É necessário escrever um resumo sobre a exceção

source: You can describe here what you were doing when this issue rised.
pt_br: Descrever aqui o que você estava fazendo quando este problema ocorreu.

source: Su&mmary:
pt_br: Resu&mo:

source: &Describe what you were doing when the exception occured:
pt_br: &Descrever o que você estava fazendo quando a exceção ocorreu:

source: Issue summary
pt_br: Resumo do problema

source: Comment area
pt_br: Área de comentário

source: or you can send the report as a guest.
pt_br: ou você pode enviar um relatório como visitante.

source: The report contains UI gesture data collected prior to the exception.
pt_br: O relatório contém dados de gestos de UI coletados antes da exceção.

source: &Password:
pt_br: &Senha:

source: Send &Report as a Guest
pt_br: Enviar &relatório como um visitante

source: Username or password is wrong
pt_br: Usuário ou senha inválidos

source: (Your NetBeans.org username)
pt_br: (Seu usuário do NetBeans.org)

source: Connecting to UI Gestures Collector
pt_br: Conectando ao coletor de gestos de UI

source: Loading initial welcome page.
pt_br: Carregando página de boas-vindas inicial.

source: Please wait...
pt_br: Aguarde...

source: Submit UI Logs
pt_br: Enviar logs de UI

source: Submit {0} Logged UI Events for Evaluation...
pt_br: Enviar {0} de eventos UI logados para avaliação...

source: Logs uploaded to server, see what hints the server has for you...
pt_br: Logs enviados ao servidor, veja quais dicas o servidor tem para você...

source: This module is capable of collecting various information about user actions.
pt_br: Este módulo é capaz de coletar várias informações sobre ações do usuário.

source: It contains UI elements that allow inspection and submission of these data to the collecting server.
pt_br: Contém elementos UI que permite a inspeção e envio destes dados para o servidor.

source: UI Gestures Collector Infrastructure
pt_br: Infra-estrutura do coletor de gestos de UI

source: UI Gestures Collector
pt_br: Coletor de gestos de UI

source: UI Gestures
pt_br: Gestos de UI

source: Message Parameters
pt_br: Parâmetros de mensagem

source: Param #{0}
pt_br: Parâmetro #{0}

source: Shows value of message parameter #{0}
pt_br: Exibe o valor do parametro da mensagem #{0}

source: When
pt_br: Quando

source: Time when the event happened
pt_br: Hora em que o evento ocorreu

source: Logger Name
pt_br: Nome do logger

source: Name of the logger that generated the event
pt_br: Nome do logger que gerou o evento

source: Message
pt_br: Messagem

source: The actual message from the log
pt_br: A mensagem atual do log

source: Collects Information about UI Gestures
pt_br: Informação coletada sobre gestos de UI

source: {0} (<i>Toolbar Action</i>)
pt_br: {0} (<i>Ação da barra de ferrametnas</i>)

source: {0} (<i>Menu Action</i>)
pt_br: {0} (<i>Ação do menu</i>)

source: {0} (<i>Keyboard Action</i>)
pt_br: {0} (<i>Ação do teclado</i>)

source: {0} (<i>Exception</i>)
pt_br: {0} (<i>Exceção</i>)

source: Enabled Modules
pt_br: Módulos habilitados

source: Disabled Modules
pt_br: Módulos desabilitados

source: The operating system is {0}, virtual machine {1}, NetBeans version {2} and user name {3}.
pt_br: O sistema operacional é {0}, máquina virtual {1}, NetBeans vesão {2} e usuário {3}.

source: User Configuration
pt_br: Configuração do usuário

source: List of disabled modules {0} {1} {2} {3} {4} {5} {6} {7} {8} {9} ...
pt_br: Lista de módulos desabilitados {0} {1} {2} {3} {4} {5} {6} {7} {8} {9} ...

source: List of enabled modules {0} {1} {2} {3} {4} {5} {6} {7} {8} {9} ...
pt_br: Lista de módulos habilitados {0} {1} {2} {3} {4} {5} {6} {7} {8} {9} ...

source: E&xit without Getting Statistics
pt_br: Sai&r sem obter as estatísticas

source: Remind &Later
pt_br: &Lembrar depois

source: Cancel
pt_br: Cancelar

source: &Review and Report Problem
pt_br: &Revisar e reportar problema

source: Upload of log to {0} failed!
pt_br: Envio do log para {0} falhou!

source: Upload of log to {0} failed, please report the problem at http://www.netbeans.org/community/issues.html
pt_br: Envio do log para {0} falhou, por favor relate o problema para http://www.netbeans.org/community/issues.html

source: Uploading log file
pt_br: Enviando arquivo de log

source: Connecting...
pt_br: Conectando...

source: Sending logs...
pt_br: Enviando logs...

source: Reading reply...
pt_br: Lendo resposta...

source: Structured
pt_br: Estruturado

source: Raw
pt_br: Cru

source: Connecting ...
pt_br: Conectando...

source: Show Record:
pt_br: Exibir registro:

source: Welcome to UI Gestures Collector
pt_br: Bem-vindo ao coletor de gestos de UI

source: This is the entry page to the world of statistics.
pt_br: Esta é a página de entrada ao mundo das estatísticas.

source: The UI Gestures Collector is a portal that allows you to find new tips on how to use NetBeans, discover what developers using the same technologies do the most, and also submit feedback to the NetBeans development team.
pt_br: O Coletor de gestos de UI é um portal que permite você encontrar novas dicas de como utilizar o NetBeans, descobrir ainda o que desenvolvedores usando a mesma tecnologia utilizam mais, e também enviar comentários ao time de desenvolvimento do NetBeans.

source: The basic idea is that you tell the server what you do, and the server, based on received data can generate metrics, statistics, or provide an advice targeted directly to you on how to use the NetBeans IDE in a better way.
pt_br: A idéia básica é que você informe ao servidor o que você faz, e o servidor, baseado nestes dados, poder gerar métricas, estatísticas e ainda prover relatórios diretamente à você de como poder aproveitar o NetBeans IDE da melhor forma possível.

source: You can now submit data about the UI actions you did in the IDE until now, and if you do so, the server records them and gives you some statistics.
pt_br: Você pode enviar agora dados sobre as ações de UI as quais você utilizou no IDE até o momento, e se você fizer isso, o servidor irá armazená-los e retornar algumas estatísticas.

source: Right now the whole system is in development mode, so we are still mostly collecting data, but some basic information comparing your usage to average usage of all participants in the program shall nevertheless be available.
pt_br: No momento o sistema como um todo encontra-se em modo de desenvolvimento, por isso, o trabalho maior no momento é sobre coleta de dados, mas algumas informações básicas comparando sua utilização média e uso de todos os participantes no programa, no entanto, devem estar disponíveis.

source: However your computer seems to be disconnected from the network.
pt_br: Entretanto seu computador aparenta estar desconectado da rede.

source: That is why we cannot connect to the server that could handle your submition request.
pt_br: Este é o motivo de não conseguir conectar ao servidor o qual pode tratar de sua submissão.

source: reportDialog
pt_br: Caixa de diálogo de relatório

source: Refresh
pt_br: Atualizar

source: Set Proxy
pt_br: Definir Proxy

source: &amp;Submit Data
pt_br: &amp;Enviar dados

source: &amp;Hide Data
pt_br: &amp;Ocultar dados

source: &amp;View Data
pt_br: &amp;Visualizar dados

source: &amp;Cancel
pt_br: &amp;Cancelar

source: UI Handler Library
pt_br: Biblioteca de manipulação de UI
